START = """Привет! С помощью этого бота ты можешь удобно следить за своими финансами😉
Рекомендую начать с команды /help"""

GET_ID = """Твой ID в телеграме: {user_id}"""

SUCCESSFUL_REGISTRATION = """Поздравляю! Ты успешно зарегистрировался и открыл себе доступ ко всему функционалу бота🎉"""

DOUBLE_REGISTRATION = """Ты не можешь зарегистрироваться, так как ты уже зарегистрирован!"""

RECREATE_DONE = """Таблица успешно пересоздана, все данные были удалены!🤯"""

HELP = """/help - увидеть это сообщение
/start - увидеть стартовое сообщение
/recreate - пересоздать базу данных
/get_id - узнать свой айди в телеге
/register - зарегистрироваться в системе (необходимо для доступа к следующим командам)

добавить [сумма] - занести эту сумму (может быть отрицательной) на свой счет
баланс - узнать свой баланс
"""

REGISTER_REQUIRED = """Сначала тебе необходимо зарегистрироваться!"""

TRANSACTION_ADDED = """Добавлено!"""

CURRENT_BALANCE = """Твой текущий баланс: {balance}"""

UNKNOWN_COMMAND = """К сожалению, я не понял, что ты имеешь в виду🙄
На всякий случай советую написать /help"""